# В первую очередь скачайте исходный код, который нужно обложить тестами с GitHub. (Можно скопировать)
# В этом коде сможете обнаружить дополненный с предыдущей задачи класс Runner и новый класс Tournament.
# Изменения в классе Runner:
# Появился атрибут speed для определения скорости бегуна.
# Метод __eq__ для сравнивания имён бегунов.
# Переопределены методы run и walk, теперь изменение дистанции зависит от скорости.
# Класс Tournament представляет собой класс соревнований, где есть дистанция,
# которую нужно пробежать и список участников. Также присутствует метод start,
# который реализует логику бега по предложенной дистанции.
#
# Напишите класс TournamentTest, наследованный от TestCase. В нём реализуйте следующие методы:
#
# setUpClass - метод, где создаётся атрибут класса all_results.
# Это словарь в который будут сохраняться результаты всех тестов.
# setUp - метод, где создаются 3 объекта:
# Бегун по имени Усэйн, со скоростью 10.
# Бегун по имени Андрей, со скоростью 9.
# Бегун по имени Ник, со скоростью 3.
# tearDownClass - метод, где выводятся all_results по очереди в столбец.
#
# Так же методы тестирования забегов, в которых создаётся объект Tournament на дистанцию 90.
# У объекта класса Tournament запускается метод start, который возвращает словарь в переменную all_results.
# В конце вызывается метод assertTrue, в котором сравниваются последний объект из all_results
# (брать по наибольшему ключу) и предполагаемое имя последнего бегуна.
# Напишите 3 таких метода, где в забегах участвуют (порядок передачи в объект Tournament соблюсти):
# Усэйн и Ник
# Андрей и Ник
# Усэйн, Андрей и Ник.
# Как можно понять: Ник всегда должен быть последним.

import unittest
from Test_Ran import Runner
from Test_Ran import Tournament

class TournamentTest(unittest.TestCase):

    @classmethod
    def setUpClass(cls):
        cls.all_results = {}

    def setUp(self):
        self.usain = Runner("Усэйн", 10)
        self.andrey = Runner("Андрей", 9)
        self.nick = Runner("Ник", 3)

    @classmethod
    def tearDownClass(cls):
        for key, result in cls.all_results.items():
            print(result)

    def test_race_usain_and_nick(self):
        tournament = Tournament(90, [self.usain, self.nick])
        result = tournament.start()
        self.__class__.all_results[1] = result
        self.assertTrue(result[max(result)] == "Ник")

    def test_race_andrey_and_nick(self):
        tournament = Tournament(90, [self.andrey, self.nick])
        result = tournament.start()
        self.__class__.all_results[2] = result
        self.assertTrue(result[max(result)] == "Ник")

    def test_race_usain_andrey_and_nick(self):
        tournament = Tournament(90, [self.usain, self.andrey, self.nick])
        result = tournament.start()
        self.__class__.all_results[3] = result
        self.assertTrue(result[max(result)] == "Ник")

if __name__ == '__main__':
    unittest.main()